export const schoolData = [
  {
    id: "20627860876593\n39777",
    name: "乐清职业中等专业学校",
    type: "中职院校",
    region: "浙江省 温州市",
  },
  {
    id: "20627008338042\n22466",
    name: "重庆市科能高级技工学校",
    type: "中职院校",
    region: "重庆 重庆市",
  },
  {
    id: "20602966954138\n33730",
    name: "福州工商学院_私有化",
    type: "高职院校",
    region: "福建省 福州市",
  },
  {
    id: "20588330894720\n69633",
    name: "天津市“海河工匠杯”",
    type: "其他",
    region: "天津 天津市",
  },
  {
    id: "20561959057535\n46754",
    name: "陕西电子教育",
    type: "其他",
    region: "陕西省 西安市",
  },
  {
    id: "20468288041437\n96225",
    name: "湛江科技学院",
    type: "高职院校",
    region: "广东省 湛江市",
  },
  {
    id: "20463883482724\n63873",
    name: "新大陆-客户教师体验试用",
    type: "独立学院",
    region: "福建省 福州市",
  },
  {
    id: "20446927968203\n77601",
    name: "【私有化】天津劳动经济",
    type: "高职院校",
    region: "天津 天津市",
  },
];

export const tenantData = [
  { id: '2062786087659339777', name: '乐清职业中等专业学校', type: '学校', updateTime: '2026-06-05 14:38:23' },
  { id: '2062700833804222466', name: '重庆市科能高级技工学校', type: '学校', updateTime: '2026-06-05 08:59:37' },
  { id: '2060296695413833730', name: '福州工商学院_私有化', type: '学校', updateTime: '2026-05-29 17:46:25' },
  { id: '2058833089472069633', name: '天津市“海河工匠杯”', type: '学校', updateTime: '2026-05-25 16:50:34' },
  { id: '2056195905753546754', name: '陕西电子教育', type: '学校', updateTime: '2026-05-18 10:11:21' },
  { id: '2046828804143796225', name: '湛江科技学院', type: '学校', updateTime: '2026-04-22 13:49:50' },
  { id: '2046388348272463873', name: '新大陆-客户教师体验试用', type: '学校', updateTime: '2026-04-21 08:39:37' },
  { id: '2044692796820377601', name: '【私有化】天津劳动经济', type: '学校', updateTime: '2026-04-16 16:22:06' },
  { id: '2044263883384246273', name: '【私有化】山东胜利职院', type: '学校', updateTime: '2026-04-15 11:57:45' },
  { id: '2043977392556822530', name: '漳州第一职业中专学校_私有化', type: '学校', updateTime: '2026-04-14 16:59:20' },
  { id: '2041479984233549825', name: '测试租户008', type: '学校', updateTime: '2026-04-07 19:35:32' },
  { id: '2041473574154674178', name: '【测试】新套餐模式0407', type: '学校', updateTime: '2026-04-07 19:10:03' },
];

export const platformData = [
  { id: '1', name: '智慧教学实验平台', rolesMap: { 'teacher': ['教务管理员', '教师'] } },
  { id: '2', name: 'AI技能分析系统', rolesMap: { 'student': ['学生'], 'teacher': ['辅导员'], 'admin': ['学生处职员'] } },
  { id: '3', name: '陆产通平台', rolesMap: { 'teacher': ['实训管理员', '指导教师'] } },
  { id: '4', name: '硬件智能体系统', rolesMap: { 'admin': ['数据分析师', '校领导'] } },
  { id: '5', name: '行业云', rolesMap: { 'registered': ['普通用户'] } },
  { id: '6', name: '考试系统', rolesMap: { 'teacher': ['教务管理员', '教师'] } },
];
